{
  "backend/main.mo": "Main Motoko actor implementing user profiles, mining tasks, TRC20 withdrawals with admin approval, Telegram bonus system, and role-based access control using AccessControl and UserApproval modules.",
  "feature_evidence.json": "Feature evidence report documenting implementation of authentication, TRC20 withdrawals (20 USDT minimum), mining system (1-5 days, 2 USDT/day), admin panel, and Telegram integration with 1.5 USDT bonus.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files including React components, pages, hooks, and styling for the mining platform with authentication, mining, withdrawals, and admin features.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for a cryptocurrency mining aesthetic with blue/cyan accents.",
  "frontend/index.html": "HTML entry point for the Mining Website application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main React application with TanStack Router, Internet Identity authentication, profile setup flow, approval status checks, and conditional routing based on user authentication and admin status.",
  "frontend/src/components/AdminUserApprovalList.tsx": "Admin component displaying user approval requests in a table with approve/reject actions, status badges, and pending approval count using React Query hooks.",
  "frontend/src/components/AdminWithdrawalQueue.tsx": "Admin component that displays a table of all withdrawal transactions with filtering for pending requests, allowing admins to approve or reject withdrawals with toast notifications for success/error states.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright information, a Telegram link, and attribution to caffeine.ai with dynamic year and app identifier.",
  "frontend/src/components/Header.tsx": "Navigation header with logo, authenticated navigation menu (Dashboard, Mining, Withdrawal, Admin), and login button, with conditional admin menu item based on user role.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component that handles Internet Identity login/logout with loading states and query cache clearing on logout.",
  "frontend/src/components/MiningPanel.tsx": "Component for starting mining tasks with radio button selection for 1-5 day durations, displaying calculated earnings (2 USDT/day) and a start button with loading state.",
  "frontend/src/components/MiningStatus.tsx": "Displays active and completed mining tasks with progress bars, earnings calculations based on elapsed time, and task metadata including start time and duration.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for first-time users to create their profile by entering a name, which creates a UserProfile with initial zero balance and mining count.",
  "frontend/src/components/TelegramFollowCard.tsx": "Promotional card offering 1.5 USDT bonus for joining the Telegram channel, with buttons to open Telegram and claim the bonus, hiding after successful claim.",
  "frontend/src/components/WithdrawalForm.tsx": "React component that renders a form for users to request USDT withdrawals to TRC20 wallet addresses, with validation for minimum amount (20 USDT) and balance checks.",
  "frontend/src/components/WithdrawalHistory.tsx": "Displays a scrollable list of user withdrawal transactions with status badges (pending, approved, rejected) and transaction details including amount and wallet address.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and manages the backend actor instance with Internet Identity authentication, initializing access control with an admin token from URL parameters.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating backend data including user profiles, transactions, mining tasks, withdrawals, and admin operations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color schemes for UI components including primary, secondary, muted, and destructive colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin-only page with tabbed interface for managing withdrawal requests and user approval requests, with access control checking if the caller is an admin.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard page displaying user balance, active mining tasks count, total earnings, and navigation cards to mining and withdrawal pages. Includes TelegramFollowCard for users who haven't followed the channel.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with hero section featuring background image, key statistics (2 USDT daily, 1-5 days duration, 20 USDT minimum), and feature cards explaining automated mining, instant withdrawals, and bonus rewards.",
  "frontend/src/pages/MiningPage.tsx": "Mining page showing current balance, mining information card, and two main components: MiningPanel for starting new mining tasks and MiningStatus for displaying active/completed tasks.",
  "frontend/src/pages/WithdrawalPage.tsx": "Withdrawal page with alert about 20 USDT minimum and TRC20 network requirement, containing WithdrawalForm for submitting requests and WithdrawalHistory for viewing past withdrawals.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from query strings or hash-based routing, with sessionStorage persistence support for maintaining state like admin tokens across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme for charts/sidebar, custom animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state document defining a cryptocurrency mining platform with TRC20 withdrawals, 2 USDT daily earnings, admin approval workflow, Telegram integration, and six completed features including authentication, mining automation, and admin panel."
}