{
  "backend/main.mo": "Main backend actor implementing user profiles, mining tasks, withdrawal transactions, and admin access control with approval workflows using Map-based storage and role-based permissions.",
  "feature_evidence.json": "Feature evidence report documenting four high-confidence features: mining start button fix, removal of 7-day mining option, admin panel improvements, and withdrawal system fixes with associated test IDs and component dependencies.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing components for authentication, mining, withdrawals, admin management, and UI with emphasis on error handling and query invalidation.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for a cryptocurrency mining application with blue/cyan accents.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for the Mining Website application.",
  "frontend/src/App.tsx": "Root application component managing authentication flow, profile setup, approval status checks, and routing between landing, dashboard, mining, withdrawal, and admin pages with loading states.",
  "frontend/src/components/AdminUserApprovalList.tsx": "Admin component displaying pending user approval requests in a table with approve/reject actions, status badges, and toast notifications for success/error feedback.",
  "frontend/src/components/AdminWithdrawalQueue.tsx": "Admin component that displays a table of pending withdrawal transactions with approve/reject actions, using custom hooks for fetching transactions and processing approvals/rejections with toast notifications.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright information, a Telegram link, and a \"Built with caffeine.ai\" attribution with dynamic year and app identifier.",
  "frontend/src/components/Header.tsx": "Sticky header component with app branding, navigation menu (Dashboard, Mining, Withdrawal, Admin for admins), and login button, conditionally rendered based on authentication state.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component that handles Internet Identity login/logout with loading states, query cache clearing, and error handling for duplicate authentication attempts.",
  "frontend/src/components/MiningPanel.tsx": "Card component for starting mining tasks with radio button duration selection (1-5 days), displaying earnings calculation (2 USDT/day), and a submit button with loading state.",
  "frontend/src/components/MiningStatus.tsx": "Displays active mining tasks with progress bars, earnings calculations based on elapsed time, task status badges, and completion tracking for each mining task.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for first-time user profile setup that collects a name/wallet input and creates a UserProfile with initial zero balance and mining count.",
  "frontend/src/components/TelegramFollowCard.tsx": "Promotional card offering a 1.5 USDT bonus for joining the Telegram channel, with buttons to open Telegram and claim the bonus, hiding itself after successful claim.",
  "frontend/src/components/WithdrawalForm.tsx": "React component that renders a form for users to request USDT withdrawals to TRC20 wallet addresses, with validation for minimum amount (20 USDT) and balance checks.",
  "frontend/src/components/WithdrawalHistory.tsx": "Displays a scrollable list of user withdrawal transactions sorted by ID (newest first), showing status badges (pending/approved/rejected), amounts, and wallet addresses.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an authenticated or anonymous backend actor using Internet Identity, initializing access control with an admin token from URL parameters.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend API calls including user profiles, transactions, withdrawals, mining tasks, and admin operations with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme colors for UI components including primary, secondary, accent, and chart colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin-only page with tabbed interface for managing withdrawal requests and user approval requests, with access control checking if the caller is an admin.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard page displaying user balance, active mining tasks count, total earnings, and navigation cards to mining and withdrawal pages. Includes conditional TelegramFollowCard display.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with hero section featuring background image, key metrics (2 USDT daily, 1-5 days duration, 20 USDT minimum), and feature cards explaining automated mining, flexible duration, secure withdrawals, and bonus rewards.",
  "frontend/src/pages/MiningPage.tsx": "Mining page displaying current balance, mining information card, and two-column layout with MiningPanel for starting tasks and MiningStatus for viewing active tasks.",
  "frontend/src/pages/WithdrawalPage.tsx": "Withdrawal page with alert about 20 USDT minimum and TRC20 requirements, displaying WithdrawalForm and WithdrawalHistory components in a two-column grid.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from query strings and hash-based routing, with sessionStorage persistence support and parameter cleanup functionality.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system, extended theme for sidebar/chart colors, container queries, typography plugin, and custom animations for accordions.",
  "project_state.json": "Project state tracking cryptocurrency mining platform features including TRC20 withdrawals, 2 USDT daily mining earnings, admin approval workflow, and known issues with mining button and withdrawal system."
}