{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix mining functionality, improve admin panel, and fix withdrawal system",
  "requirements": [
    {
      "id": "REQ-7",
      "summary": "Fix the mining start button functionality to properly initiate mining tasks and update UI to reflect active mining status",
      "acceptanceCriteria": [
        "Clicking the start mining button successfully creates a mining task in the backend",
        "The UI immediately updates to show the mining task is active",
        "The mining progress bar displays correctly after starting",
        "No errors occur during the mining task creation process"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MiningPanel.tsx",
          "operation": "modify",
          "description": "Fix the start mining button click handler to properly call the backend startMining capability with the selected duration. Ensure proper error handling with user-friendly error messages using toast notifications. Add loading state management to prevent duplicate submissions. After successful mining task creation, invalidate the 'miningTasks' and 'userProfile' queries to trigger UI updates that reflect the new active mining status."
        },
        {
          "path": "frontend/src/components/MiningStatus.tsx",
          "operation": "modify",
          "description": "Enhance the mining status component to immediately reflect new mining tasks after creation. Ensure the progress bar calculations are accurate based on elapsed time. Add proper handling for the transition from 'active' to 'expired' mining states. Display clear visual feedback when mining tasks are in progress versus completed."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Review and fix the startMining mutation hook to ensure it properly handles the backend response, invalidates relevant queries (miningTasks, userProfile), and provides appropriate success/error feedback. Ensure the mutation optimistically updates or refetches data to provide immediate UI feedback."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Remove the 7-day mining duration option from the mining panel, keeping only 1-5 day duration options",
      "acceptanceCriteria": [
        "Mining panel only shows duration options from 1 to 5 days",
        "No 7-day option is visible or selectable in the UI",
        "All remaining duration options (1-5 days) function correctly"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MiningPanel.tsx",
          "operation": "modify",
          "description": "Update the duration options array to only include values from 1 to 5 days. Remove any reference to a 7-day option. Ensure the radio button list correctly renders only the 1-5 day options with their corresponding earnings calculations (2 USDT per day)."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Improve the admin panel implementation to ensure all withdrawal approval/rejection actions work reliably with proper feedback",
      "acceptanceCriteria": [
        "Admin can successfully approve withdrawal requests and the status updates correctly",
        "Admin can successfully reject withdrawal requests with proper status updates",
        "Clear success or error messages appear after each action",
        "The withdrawal queue refreshes automatically after approve/reject actions",
        "All admin controls are clearly visible and functional"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AdminWithdrawalQueue.tsx",
          "operation": "modify",
          "description": "Fix the approve and reject withdrawal action handlers to properly call the backend approveWithdrawal and rejectWithdrawal capabilities. Ensure comprehensive error handling with clear toast notifications for both success and failure cases. After each action, invalidate the 'allTransactions' query to automatically refresh the withdrawal queue. Add loading states to action buttons to prevent duplicate submissions. Ensure the pending filter works correctly and the UI clearly displays the current status of each withdrawal request."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Review and enhance the approve and reject withdrawal mutation hooks. Ensure they properly handle backend responses, provide appropriate error messages, and trigger query invalidation for both 'allTransactions' and 'transactions' to update both admin and user views. Add optimistic updates or immediate refetch strategies for better UX."
        },
        {
          "path": "frontend/src/pages/AdminDashboard.tsx",
          "operation": "modify",
          "description": "Ensure the admin dashboard properly integrates the AdminWithdrawalQueue component with clear tab navigation. Verify that the admin access control check using the authorization component is working correctly and displays an appropriate access denied message for non-admin users. Ensure the page layout provides clear visibility of all admin controls."
        }
      ]
    },
    {
      "id": "REQ-10",
      "summary": "Fix the withdrawal system to ensure withdrawal requests are properly created, processed, and displayed with correct status updates",
      "acceptanceCriteria": [
        "Users can successfully submit withdrawal requests with valid TRC20 addresses",
        "Withdrawal requests appear in both user withdrawal history and admin queue",
        "Withdrawal status updates correctly when approved or rejected by admin",
        "User balance is properly deducted when withdrawal is approved",
        "Minimum 20 USDT validation works correctly",
        "Error messages display clearly when withdrawals fail validation"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/WithdrawalForm.tsx",
          "operation": "modify",
          "description": "Fix the withdrawal request submission handler to properly call the backend requestWithdrawal capability with the TRC20 wallet address and amount. Ensure robust validation for minimum 20 USDT amount and sufficient balance before submission. Improve error handling to display clear, user-friendly error messages via toast notifications. After successful submission, invalidate 'transactions' and 'userProfile' queries to update the withdrawal history and balance display. Add loading state to prevent duplicate submissions."
        },
        {
          "path": "frontend/src/components/WithdrawalHistory.tsx",
          "operation": "modify",
          "description": "Ensure the withdrawal history component properly displays all user transactions with accurate status badges (pending, approved, rejected). Verify that the component refreshes when new withdrawals are submitted or when existing withdrawals are approved/rejected by admins. Improve the visual presentation of transaction details including amount, wallet address, and timestamp if available."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Review and fix the requestWithdrawal mutation hook to ensure proper backend integration, error handling, and query invalidation. Ensure it invalidates both 'transactions' (for user view) and 'allTransactions' (for admin view) after successful submission. Add proper TypeScript typing for the withdrawal request parameters and backend response."
        },
        {
          "path": "frontend/src/pages/WithdrawalPage.tsx",
          "operation": "modify",
          "description": "Verify the withdrawal page properly integrates the WithdrawalForm and WithdrawalHistory components. Ensure the alert message about the 20 USDT minimum and TRC20 network requirement is clearly visible. Verify the page layout provides good user experience with proper spacing and visual hierarchy."
        }
      ]
    }
  ]
}